[
  {
    "title": "AITA for telling my sister to stop mommyjacking every conversation and to let me talk about myself?",
    "subreddit": "r/AmItheAsshole",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1qxxjh1/aita_for_telling_my_sister_to_stop_mommyjacking/",
    "upvotes": 5601,
    "comments": 671,
    "viral_score": 6943,
    "summary": "OP's sister constantly derails family group chats to talk about her kids (mommyjacking). OP finally snapped after a job crisis was ignored, and now the family is taking the sister's side.",
    "hook": "For once can a conversation be about me without you mommyjacking it?"
  },
  {
    "title": "TIFU thinking with my dick",
    "subreddit": "r/tifu",
    "url": "https://www.reddit.com/r/tifu/comments/1qybmz6/tifuthinking_with_my_dick/",
    "upvotes": 3313,
    "comments": 434,
    "viral_score": 4181,
    "summary": "An awkward encounter with a pregnant woman from TikTok leads to a painful 'snapping' injury and a very embarrassing medical inspection by OP's nurse mother.",
    "hook": "My brain said walk away, but my dick said live a little. I listened to the latter."
  },
  {
    "title": "AITA for skipping my friend's daughter’s 1st birthday and charging her for the 'gift' after she forgot to tell me the time changed?",
    "subreddit": "r/AmItheAsshole",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1qydatl/aita_for_skipping_my_friends_daughters_1st/",
    "upvotes": 1581,
    "comments": 614,
    "viral_score": 2809,
    "summary": "OP spent all day making expensive truffles for a friend's party. The friend changed the time and 'forgot' to tell only OP. OP now wants to bill her for the ingredients.",
    "hook": "I showed up at 9 AM sharp, truffles in hand, and the place was empty."
  },
  {
    "title": "TIFU having severe stomach issues for more than a year and unable to find the root cause",
    "subreddit": "r/tifu",
    "url": "https://www.reddit.com/r/tifu/comments/1qy76o8/tifu_having_severe_stomach_issues_for_more_than_a/",
    "upvotes": 1485,
    "comments": 265,
    "viral_score": 2015,
    "summary": "After a year of chronic diarrhea and 8 different rice cookers, OP discovers the culprit was wetting uncooked rice and letting bacteria grow.",
    "hook": "For more than a year, I’ve been getting stomach cramps and diarrhea whenever I cook and eat at home."
  },
  {
    "title": "AITA backing out of the baby shower of my brother's girlfriend who is also my pregnant best friend of 22 years?",
    "subreddit": "r/AmItheAsshole",
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1qxxc7f/aita_backing_out_of_the_baby_shower_of_my/",
    "upvotes": 1323,
    "comments": 87,
    "viral_score": 1497,
    "summary": "OP's best friend is pregnant by OP's brother and wants to invite OP's cheating ex-fiancé to the baby shower OP is hosting.",
    "hook": "She casually asked if I'd be comfortable with her inviting my ex and his girlfriend."
  }
]
